---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.ISingleServerService
source: html/c787ac64-895b-72e3-1da2-dfc4f649b5a0.htm
---
# ISingleServerService Members

Implement this method to execute the given server.